Revit 2026 API

# SubTransactionHasStarted Method

---

Determines whether the sub-transaction has been started yet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasStarted()
```
```vb
Public Function HasStarted As Boolean
```
```cpp
public:
bool HasStarted()
```
```fsharp
member HasStarted : unit -> bool
```

#### Return Value

Boolean True if the sub-transaction has already started, False otherwise.

A sub-transaction is considered being started after the Start method was called and until the sub-transaction is either committed or rolled back.

#### Reference

SubTransaction Class

Autodesk.Revit.DB Namespace